disp('Нулі та полюси інтегратора методом прямокутників') 
x1 = roots(b);
disp(x);
disp('Нулі та полюси інтегратора методом трапецій') 
x2 = roots(b1);
disp(x2);
disp('Нулі та полюси інтегратора методом Сімпсона') 
x3 = roots(b2); 
disp(x3);
figure(42);
subplot(3,1,1); 
k = zplane(x1);
title('Карта нулів та полюсів інтегратора методом прямокутників')
subplot(3,1,2); 
k1 = zplane(x2);
title('Карта нулів та полюсів інтегратора методом трапецій')
subplot(3,1,3); 
k2 = zplane(x3);
title('Карта нулів та полюсів інтегратора методом Сімпсона')
disp('Передавальна функція інтегратора методом прямокутників') 
H = filt(b,a)
disp('Передавальна функція інтегратора методом трапецій') 
H1 = filt(b1,a1)
disp('Передавальна функція інтегратора методом Сімпсона') 
H2 = filt(b2,a2)
